:PROPERTIES:
:ID:       e2ab84be-ecc1-4556-b23e-a074ba0b8f10
:END:
#+TITLE: Emacs: Learning GNUS
#+CATEGORY: slips
#+TAGS:

**** Auto-fetch =nnimap= mail when not =closed=

... I think I forgot about the Gnus Agent, so the =gnus-demon= callbacks
probably aren't the best way to do this.

#+begin_example emacs-lisp
(defun gnus-server-status (method)
  "Return the status of METHOD."
  (nth 1 (assoc method gnus-opened-servers)))
#+end_example

Use =gnus-server-staus= from =gnus.el=

#+begin_src
(gnus-server-status '(nnimap "imap.gmail.com"))
#+end_src

A little unwieldy for noobs, since you need to query on an exact list containing
many of the connection details.

#+begin_src emacs-lisp
(pp gnus-opened-servers)
#+end_src

#+RESULTS:
#+begin_example
(((nndraft "")
  ok)
 ((nntp "news.gmane.io")
  ok)
 ((nnfolder "archive"
            (nnfolder-directory "~/Mail/archive")
            (nnfolder-active-file "~/Mail/archive/active")
            (nnfolder-get-new-mail nil)
            (nnfolder-inhibit-expiry t))
  ok)
 ((nnimap "imap.gmail.com")
  closed))
#+end_example




